In [1]:
import pandas as pd

In [2]:
data_file = 'data/stocks.csv'
stocks = pd.read_csv(data_file)

In [3]:
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [4]:
stocks.columns

Index(['Date', 'Close', 'Volume', 'Symbol'], dtype='object')

In [5]:
stocks.index #es un índice normal y corriente, no un multiindex

RangeIndex(start=0, stop=9, step=1)

In [6]:
stocks.groupby('Symbol').Close.mean()

Symbol
AAPL    112.856667
CSCO     31.480000
MSFT     57.433333
Name: Close, dtype: float64

In [7]:
stocks.groupby(['Symbol', 'Date']).Close.mean()

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

tenemos solo un precio por ticker por dia, si hubiera varios sale un promedio, es un ejemplo ... Ahora tenemos una **serie** con un multi-index, entonces llamémoslo `ser`

In [8]:
ser = stocks.groupby(['Symbol', 'Date']).Close.mean() 
ser.index

MultiIndex([('AAPL', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('AAPL', '2016-10-05'),
            ('CSCO', '2016-10-03'),
            ('CSCO', '2016-10-04'),
            ('CSCO', '2016-10-05'),
            ('MSFT', '2016-10-03'),
            ('MSFT', '2016-10-04'),
            ('MSFT', '2016-10-05')],
           names=['Symbol', 'Date'])

Es una serie con dos dimensiones. Podemos convertirla en DF en este caso con unstack

In [9]:
ser.unstack()

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

Podríamos hacer lo mismo con `pivot_table` que por default la función de agregación es el mean

In [10]:
stocks.pivot_table(values='Close', index='Symbol', columns='Date') #esto es un dataframe

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [11]:
ser

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [12]:
#seleccionar todos los datos de APPL 
ser.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: Close, dtype: float64

In [13]:
# APPL el 2016-10-05
ser.loc['AAPL','2016-10-05']

113.05

In [14]:
# selecciono una fecha
ser.loc[:,'2016-10-05']

Symbol
AAPL    113.05
CSCO     31.59
MSFT     57.64
Name: Close, dtype: float64

Es `ser.loc[FIRST_LEVEL, SECOND_LEVEL]`

Volviendo para atrás, recordemos que con `unstack` o con `pivot_table` teníamos un `DataFrame`. Podemos llamar los datos de la misma manera que en la serie con multi-index

In [15]:
df = ser.unstack()

In [16]:
df.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: AAPL, dtype: float64

In [17]:
df.loc['AAPL','2016-10-05']

113.05

In [18]:
df.loc[:,'2016-10-05']

Symbol
AAPL    113.05
CSCO     31.59
MSFT     57.64
Name: 2016-10-05, dtype: float64

Vamos a un `DataFrame` con multi-index

In [19]:
stocks.set_index(['Symbol','Date'], inplace=True)

In [20]:
stocks

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-05   57.64  16726400
CSCO   2016-10-05   31.59  11808600
AAPL   2016-10-05  113.05  21453100

In [21]:
stocks.index

MultiIndex([('CSCO', '2016-10-03'),
            ('AAPL', '2016-10-03'),
            ('MSFT', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('MSFT', '2016-10-04'),
            ('CSCO', '2016-10-04'),
            ('MSFT', '2016-10-05'),
            ('CSCO', '2016-10-05'),
            ('AAPL', '2016-10-05')],
           names=['Symbol', 'Date'])

In [22]:
#ordenemoslo un poco
stocks.sort_index(inplace=True)
#ordena primero por el level exterior y depués el interior

In [23]:
stocks

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [24]:
stocks.loc['AAPL']

             Close    Volume
Date
2016-10-03  112.52  21701800
2016-10-04  113.00  29736800
2016-10-05  113.05  21453100

In [25]:
stocks.loc['AAPL','2016-10-05']

Close          113.05
Volume    21453100.00
Name: (AAPL, 2016-10-05), dtype: float64

Esto funciona pero no es tan buena práctica, mejor así, porque pandas se puede confundir que necesitamos

In [26]:
stocks.loc[('AAPL','2016-10-05'),:]

Close          113.05
Volume    21453100.00
Name: (AAPL, 2016-10-05), dtype: float64

In [27]:
stocks.loc[('AAPL','2016-10-05'),'Close']

113.05

y si queremos múltiples stocks

In [28]:
stocks.loc[(['AAPL','MSFT']),:]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [29]:
stocks.loc[(['AAPL','MSFT'],'2016-10-05'),:]

                    Close    Volume
Symbol Date
AAPL   2016-10-05  113.05  21453100
MSFT   2016-10-05   57.64  16726400

In [30]:
stocks.loc[(['AAPL','MSFT'],'2016-10-05'),'Close']

Symbol  Date
AAPL    2016-10-05    113.05
MSFT    2016-10-05     57.64
Name: Close, dtype: float64

In [31]:
stocks.loc[('AAPL',['2016-10-03','2016-10-05']),['Close','Volume']]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-05  113.05  21453100

In [32]:
stocks.loc[(:,['2016-10-03','2016-10-05']),:]

SyntaxError: invalid syntax (2021702117.py, line 1)

Eso no funciona. Hay que hacer un truco

In [ ]:
stocks.loc[(slice(None),['2016-10-03','2016-10-05']),:]

In [ ]:
help(slice)

Como concatenar en multi-index

In [ ]:
volume = pd.read_csv(data_file, usecols=[0,2,3] , index_col=['Symbol','Date']).sort_index()
volume

In [ ]:
close = pd.read_csv('data/stocks.csv', usecols=[0, 1, 3], index_col=['Symbol', 'Date']).sort_index()
close

In [ ]:
both = pd.merge(close, volume, left_index=True, right_index=True)
both
#si hubiera datos faltantes habría que hacer un how=... en el merge

In [ ]:
both.reset_index()